import {IAbout} from "@/data/about/model/IAbout";

export const AboutJA: IAbout = {
    title: "概要",
    span: "総合的なシステム分析とソフトウェア開発",
    subTitle: "ビジネス成功のための技術革新",
    description: [
        {
            "title": "製造実行システム (MES)",
            "description": "2001年以降、CHORNは大量生産向け電子機器のソフトウェアおよびハードウェアエンジニアリングを専門とし、製造実行システム (MES) の専門知識により、月間1,000万台以上の生産スケーリングを効率的かつ信頼性高く実現しています。"
        },
        {
            "title": "デジタルプラットフォーム開発",
            "description": "2012年以降、デジタルプラットフォーム開発の能力を拡大し、最新の技術とフレームワークに基づいたスケーラブルなWebおよびモバイルソリューションを提供しています。プラットフォームは月間数百万の訪問者に対応できるように成功裏にスケーリングされ、SAP ERPおよびS/4HANAを活用した企業システムの開発、導入、構成プロジェクトも含まれます。"
        },
        {
            title: "勤務地と勤務形態",
            description: "チェンマイ、バンコク、および国際的に、リモート、ハイブリッド、オフィスワークを通じてソフトウェアを開発します。概念実証（PoC）アプリケーション、実用最小限の製品（MVP）を作成し、システム要件の分析を支援し、変化するビジネスニーズに対応するために既存のシステムを改善します。"
        }
    ],
    stacks: [
        {
            title: "ソフトウェア開発と企業システム統合",
            description: "急成長するスタートアップやデジタルファースト企業向けに、エンドツーエンドのソフトウェア開発とエンタープライズシステム統合を提供します。最新のフレームワークを活用し、スケーラブルなFront-endおよびBack-endシステムを構築すると同時に、SAP ERP、S/4HANA、CRM、MES、e-commerceなどの重要なプラットフォームを統合します。当社のソリューションは、堅牢なAPIアーキテクチャ、WebService（REST/SOAP）、およびAI-LLM統合によって、部門横断的なデータフローと業務自動化を強化します。"
        },
        {
            title: "システム分析と技術サポート",
            description: "重要なアプリケーションとシステムを強化するための詳細なシステム分析と技術的な推奨事項。信頼性、品質管理、ソフトウェアテスト、そして継続的なビジネス運営と改善のための最新技術の実装を確保します。"
        },
        {
            title: "アジャイルソフトウェア開発とビジネスチーム連携",
            description: "ビジネスチーム連携を伴うアジャイルソフトウェア開発。国内外のチーム、社内外のクライアント、ビジネスユーザーとの緊密な連携。アジャイル、ウォーターフォール、ハイブリッドアプローチなどの作業方法を含みます。"
        }
    ],
    contact: {
        title: "ビジネスのお問い合わせ・パートナーシップ",
        description: "創業者仲間、CEO、CTO、プロダクトリーダーからの歓迎の連絡。",
        roles: [
            {
                title: "Project Manager",
                span: "（クライアントプロジェクトの調整）",
                email: "pm@chorn.in.th"
            },
            {
                title: "Chief Technology Officer",
                span: "（技術提携や統合に関して）",
                email: "cto@chorn.in.th"
            },
            {
                title: "人事部",
                span: "（人事関連のお問い合わせ、採用、雇用について）",
                email: "hr@chorn.in.th"
            },
            {
                title: "一般のお問い合わせ",
                span: "（戦略的パートナーシップ）",
                officePhone: "オフィスの電話：+66 (52) 000 548",
                mobilePhone: "携帯電話：+66 (64) 918 1998",
                locations: {
                    office: "オフィス：405/112 ムー3、サンナメン・サブディストリクト、サンサーイ・ディストリクト、チェンマイ 50210、タイ"
                }
            },
            {
                title: "近くの場所",
                span: "",
                nearbyShopping: "セントラルフェスティバル・チェンマイ - 20分",
                nearbyUniversity1: "メージョー大学 - 22分",
                nearbyUniversity2: "チェンマイ大学 - 29分",
                nearbyAirport: "チェンマイ国際空港 - 30分"
            }
        ]
    }
};
