import {IAbout} from "@/data/about/model/IAbout";

export const AboutTH: IAbout = {
    title: "เกี่ยวกับ",
    span: "การวิเคราะห์ระบบและการพัฒนาซอฟต์แวร์ครบวงจร",
    subTitle: "นวัตกรรมเทคโนโลยีเพื่อความสำเร็จของธุรกิจ",
    description: [
        {
            title: "ระบบการดำเนินงานการผลิต (MES)",
            description: "ตั้งแต่ปี 2001 CHORN มีความเชี่ยวชาญด้านวิศวกรรมซอฟต์แวร์และฮาร์ดแวร์สำหรับการผลิตอิเล็กทรอนิกส์ปริมาณสูง โดยมีความเชี่ยวชาญในระบบการดำเนินงานการผลิต (MES) ที่ช่วยให้สามารถเพิ่มกำลังการผลิตได้มากกว่า 10 ล้านหน่วยต่อเดือนด้วยประสิทธิภาพและความน่าเชื่อถือ"
        },
        {
            title: "การพัฒนาแพลตฟอร์มดิจิทัล",
            description: "ตั้งแต่ปี 2012 ได้ขยายทักษะความสามารถไปสู่การพัฒนาแพลตฟอร์มดิจิทัล โดยการพัฒนาโซลูชันเว็บและมือถือที่ปรับขนาดได้บนเทคโนโลยีและเฟรมเวิร์กสมัยใหม่ ความสำเร็จในการปรับขนาดแพลตฟอร์มเพื่อรองรับผู้ใช้งานหลายล้านคนต่อเดือน รวมถึงโครงการที่เกี่ยวข้องกับ SAP ERP และ S/4HANA สำหรับการพัฒนาระบบองค์กร การนำไปใช้งานและการกำหนดค่า"
        },
        {
            title: "โซลูชั่นการพัฒนาซอฟต์แวร์",
            description: "พัฒนาซอฟต์แวร์ผ่านการทำงานระยะไกล แบบไฮบริด และในสำนักงานในเชียงใหม่ กรุงเทพฯ และต่างประเทศ สร้างแอปพลิเคชันพิสูจน์แนวคิด (PoC) ผลิตภัณฑ์ที่ใช้งานได้ขั้นต่ำ (MVP) ช่วยวิเคราะห์ความต้องการของระบบ และปรับปรุงระบบที่มีอยู่เพื่อตอบสนองต่อความต้องการทางธุรกิจที่เปลี่ยนแปลงไป"
        }
    ],
    stacks: [
        {
            title: "การพัฒนาซอฟต์แวร์และการเชื่อมต่อระบบองค์กร",
            description: "บริการพัฒนาซอฟต์แวร์แบบครบวงจรและการบูรณาการระบบองค์กรที่ออกแบบมาเพื่อสตาร์ทอัพที่เติบโตอย่างรวดเร็วและธุรกิจดิจิทัลเฟิร์ส โดยใช้เฟรมเวิร์กสมัยใหม่ เราสร้างระบบฟรอนต์เอนด์และแบ็กเอนด์ที่สามารถขยายได้ พร้อมทั้งดำเนินการติดตั้ง กำหนดค่า และบูรณาการแพลตฟอร์มสำคัญ เช่น SAP ERP, S/4HANA, ABAP, CRM, MES และอีคอมเมิร์ซ"
        },
        {
            title: "การวิเคราะห์ระบบและการสนับสนุนทางเทคนิค",
            description: "การทำงานวิเคราะห์ระบบเชิงลึก คำแนะนำทางเทคนิคสำหรับการปรับปรุงเพิ่มประสิทธิภาพแอปพลิเคชันและระบบมีความสำคัญต่อธุรกิจ เพื่อสร้างความมั่นใจ ความน่าเชื่อถือ การควบคุมคุณภาพและการทดสอบซอฟต์แวร์ และการใช้งานเทคโนโลยีทันสมัยเพื่อให้ธุรกิจดำเนินการและปรับปรุงอย่างต่อเนื่อง"
        },
        {
            title: "การพัฒนาซอฟต์แวร์คล่องตัว การประสานงานกับทีมงานธุรกิจ",
            description: "การพัฒนาซอฟต์แวร์คล่องตัวและประสานงานกับทีมงานธุรกิจ ทำงานใกล้ชิดกับทีมงานทั้งในและต่างประเทศ ลูกค้าภายในและภายในองค์กร ผู้ใช้งานทางธุรกิจ การทำงานแบบคล่องตัว การทำงานแบบน้ำตก และการทำงานแบบผสม"
        }
    ],
    contact: {
        title: "ติดต่อธุรกิจและความร่วมมือ",
        description: "ยินดีต้อนรับการติดต่อจากผู้ก่อตั้ง CEO, CTO และผู้นำด้านผลิตภัณฑ์",
        roles: [
            {
                title: "Project Manager",
                span: "(ประสานงานโครงการกับลูกค้า)",
                email: "pm@chorn.in.th"
            },
            {
                title: "Chief Technology Officer",
                span: "(สำหรับความร่วมมือด้านเทคโนโลยีหรือการเชื่อมต่อระบบ)",
                email: "cto@chorn.in.th"
            },
            {
                title: "ฝ่ายทรัพยากรบุคคล",
                span: "(สอบถามเกี่ยวกับทรัพยากรบุคคล สำหรับการสรรหา การจ้างงาน)",
                email: "hr@chorn.in.th"
            },
            {
                title: "สอบถามทั่วไป",
                span: "(ความร่วมมือเชิงกลยุทธ์)",
                officePhone: "เบอร์ออฟฟิศ: 052-000 548",
                mobilePhone: "เบอร์มือถือ: 064-918 1998",
                locations: {
                    office: "Office: 405/112 หมู่ 3 ตำบลสันนาเม็ง อำเภอสันทราย เชียงใหม่ 50210, ประเทศไทย",
                }
            },
            {
                title: "สถานที่ใกล้เคียง",
                span: "",
                nearbyShopping: "เซ็นทรัลเฟสติวัลเชียงใหม่ 20 นาที",
                nearbyUniversity1: "มหาวิทยาลัยแม่โจ้ 22 นาที",
                nearbyUniversity2: "มหาวิทยาลัยเชียงใหม่ 29 นาที",
                nearbyAirport: "สนามบินนานาชาติเชียงใหม่ 30 นาที"
            },
        ]
    }
};