import {IAbout} from "@/data/about/model/IAbout";

export const AboutTH: IAbout = {
    title: "เกี่ยวกับ",
    span: "การวิเคราะห์ระบบและการพัฒนาซอฟต์แวร์ครบวงจร",
    subTitle: "นวัตกรรมเทคโนโลยีเพื่อความสำเร็จของธุรกิจ",
    description: [
        {
            title: "เกี่ยวกับเรา",
            description: "ตั้งแต่ปี พ.ศ. 2544 CHORN เชี่ยวชาญด้านวิศวกรรมซอฟต์แวร์และฮาร์ดแวร์สำหรับการผลิตเซมิคอนดักเตอร์และอิเล็กทรอนิกส์ในปริมาณมาก และในปี พ.ศ. 2555 ได้ขยายสู่การพัฒนาแพลตฟอร์มดิจิทัล รวมถึงโซลูชันบนเว็บและมือถือ โดยใช้เทคโนโลยี เฟรมเวิร์ก และภาษาโปรแกรมสมัยใหม่ กระทั่งในเดือนมีนาคม พ.ศ. 2566 เราได้เปิดตัวเว็บไซต์เพื่อแบ่งปันข้อมูลเชิงลึกเกี่ยวกับความก้าวหน้าล่าสุดด้านเทคโนโลยี การพัฒนาซอฟต์แวร์ โซลูชันด้านไอทีในหลากหลายอุตสาหกรรม และเทรนด์เทคโนโลยีอื่น ๆ",
        },
        {
            title: "ความเชี่ยวชาญ",
            description: "มีความมุ่งมั่นพัฒนาความรู้ทางด้านวิศวกรรมซอฟต์แวร์และไอทีอย่างต่อเนื่อง รวมถึงการเข้าร่วมแพลตฟอร์มระดับโลกเพื่อช่วยฝึกสอนเอไอและสร้างปัญญาประดิษฐ์ (Generative AI) การต่อยอดความรู้ความเชี่ยวชาญที่เกี่ยวข้องด้านต่างๆ เช่น สถาปัตยกรรมระบบ การวิเคราะห์ข้อมูล การพัฒนาเว็บแอพพลิเคชั่น การทดสอบซอฟต์แวร์ และคลาวด์ อย่างสม่ำเสมอ",
        },
        {
            title: "โซลูชั่นการพัฒนาซอฟต์แวร์",
            description: "พัฒนาซอฟต์แวร์ผ่านการทำงานระยะไกล แบบไฮบริด และในสำนักงานในเชียงใหม่ กรุงเทพฯ และต่างประเทศ สร้างแอปพลิเคชันพิสูจน์แนวคิด (PoC) ผลิตภัณฑ์ที่ใช้งานได้ขั้นต่ำ (MVP) ช่วยวิเคราะห์ความต้องการของระบบ และปรับปรุงระบบที่มีอยู่เพื่อตอบสนองต่อความต้องการทางธุรกิจที่เปลี่ยนแปลงไป"
        }
    ],
    stacks: [
        {
            title: "การพัฒนาซอฟต์แวร์และการเชื่อมต่อระบบองค์กร",
            description: "บริการพัฒนาซอฟต์แวร์แบบครบวงจรและการผสานรวมระบบองค์กรที่ออกแบบมาเพื่อธุรกิจสตาร์ทอัพที่กำลังเติบโตอย่างรวดเร็วและองค์กรที่ให้ความสำคัญกับดิจิทัลเป็นอันดับแรก ด้วยการใช้เฟรมเวิร์กที่ทันสมัย เราสร้างระบบ Front-end และ Back-end ที่ปรับขนาดได้ พร้อมกับผสานรวมแพลตฟอร์มสำคัญๆ เช่น SAP ERP, S/4HANA, CRM, MES และอีคอมเมิร์ซ โซลูชันของเราช่วยยกระดับการไหลของข้อมูลข้ามฟังก์ชันและการทำงานอัตโนมัติผ่านสถาปัตยกรรม API ที่แข็งแกร่ง, WebService (REST/SOAP) และการผสานรวม AI-LLM"
        },
        {
            title: "การวิเคราะห์ระบบและการสนับสนุนทางเทคนิค",
            description: "การทำงานวิเคราะห์ระบบเชิงลึก คำแนะนำทางเทคนิคสำหรับการปรับปรุงเพิ่มประสิทธิภาพแอปพลิเคชันและระบบมีความสำคัญต่อธุรกิจ เพื่อสร้างความมั่นใจ ความน่าเชื่อถือ การควบคุมคุณภาพและการทดสอบซอฟต์แวร์ และการใช้งานเทคโนโลยีทันสมัยเพื่อให้ธุรกิจดำเนินการและปรับปรุงอย่างต่อเนื่อง"
        },
        {
            title: "การพัฒนาซอฟต์แวร์คล่องตัว การประสานงานกับทีมงานธุรกิจ",
            description: "การพัฒนาซอฟต์แวร์คล่องตัวและประสานงานกับทีมงานธุรกิจ ทำงานใกล้ชิดกับทีมงานทั้งในและต่างประเทศ ลูกค้าภายในและภายในองค์กร ผู้ใช้งานทางธุรกิจ การทำงานแบบคล่องตัว การทำงานแบบน้ำตก และการทำงานแบบผสม"
        }
    ],
    contact: {
        title: "ติดต่อธุรกิจและความร่วมมือ",
        description: "ยินดีต้อนรับการติดต่อจากผู้ก่อตั้ง CEO, CTO และผู้นำด้านผลิตภัณฑ์",
        roles: [
            {
                title: "Project Manager",
                span: "(ประสานงานโครงการกับลูกค้า)",
                email: "pm@chorn.in.th"
            },
            {
                title: "Chief Technology Officer",
                span: "(สำหรับความร่วมมือด้านเทคโนโลยีหรือการเชื่อมต่อระบบ)",
                email: "cto@chorn.in.th"
            },
            {
                title: "ฝ่ายทรัพยากรบุคคล",
                span: "(สอบถามเกี่ยวกับทรัพยากรบุคคล สำหรับการสรรหา การจ้างงาน)",
                email: "hr@chorn.in.th"
            },
            {
                title: "สอบถามทั่วไป",
                span: "(ความร่วมมือเชิงกลยุทธ์)",
                officePhone: "เบอร์ออฟฟิศ: 052-000 548",
                mobilePhone: "เบอร์มือถือ: 064-918 1998",
                locations: {
                    office: "Office: 405/112 หมู่ 3 ตำบลสันนาเม็ง อำเภอสันทราย เชียงใหม่ 50210, ประเทศไทย",
                }
            },
            {
                title: "สถานที่ใกล้เคียง",
                span: "",
                nearbyShopping: "เซ็นทรัลเฟสติวัลเชียงใหม่ 20 นาที",
                nearbyUniversity1: "มหาวิทยาลัยแม่โจ้ 22 นาที",
                nearbyUniversity2: "มหาวิทยาลัยเชียงใหม่ 29 นาที",
                nearbyAirport: "สนามบินนานาชาติเชียงใหม่ 30 นาที"
            },
        ]
    }
};