import {IAbout} from "@/data/about/model/IAbout";

export const AboutTH: IAbout = {
    title: "เกี่ยวกับ",
    span: "การวิเคราะห์ระบบและการพัฒนาซอฟต์แวร์ครบวงจร",
    subTitle: "นวัตกรรมเทคโนโลยีเพื่อความสำเร็จของธุรกิจ",
    description: [
        {
            title: "ระบบการดำเนินงานการผลิต (MES)",
            description: "CHORN เริ่มต้นในปี พ.ศ.2544 มีความเชี่ยวชาญด้าน IT, software และ hardware engineering สำหรับการผลิตอิเล็กทรอนิกส์ปริมาณสูง, hardware-software-mechanical design ร่วมกับ R&D engineering teams โดยมีความเชี่ยวชาญเฉพาะด้าน manufacturing execution systems, industrial-grade equipment, precision instruments, industrial protocols, custom hardware/software และ IoT เป็นผู้นำโครงการที่ควบคุมกำลังการผลิตอัตโนมัติมากกว่า 10 ล้านหน่วยต่อเดือน, การทำงานร่วมกันของทีม cross-functional และการปรับปรุงอย่างต่อเนื่องในด้านประสิทธิภาพระบบ, ความน่าเชื่อถือ และคุณภาพผลิตภัณฑ์"
        },
        {
            title: "การพัฒนาแพลตฟอร์มดิจิทัล",
            description: "ต่อมาในปี พ.ศ.2555 CHORN เริ่มขยายความเชี่ยวชาญด้าน IT และ software development ใน digital platform development โดยการสร้าง scalable web และ mobile solutions ที่พัฒนาบน modern technologies, frameworks และ cloud systems เพื่อตอบสนองความต้องการที่เพิ่มขึ้นของผู้ใช้ การออกแบบสถาปัตยกรรมมีความสามารถในการขยายและรองรับผู้ใช้หลายล้านคน รวมถึงโครงการที่เกี่ยวข้องกับ eCommerce, Real Estate, Pre-sale, CRM, SAP ERP และ S/4HANA สำหรับ enterprise system development"
        },
        {
            title: "AI-Power",
            description: "ภูมิทัศน์ดิจิทัลเปลี่ยนแปลงอย่างมากหลังจากการเปิดตัว ChatGPT และแพลตฟอร์ม OpenAI ในช่วงปลายปี พ.ศ.2565 ตั้งแต่เดือนมีนาคม พ.ศ.2566 CHORN ได้เป็นผู้บุกเบิกการพัฒนา AI-LLM และตัวแทน AI โดยใช้ประโยชน์จาก AI เพื่อปรับปรุงประสิทธิภาพของแพลตฟอร์มดิจิทัลและเร่งประสิทธิภาพการพัฒนาซอฟต์แวร์"
        },
        {
            title: "โซลูชั่นการพัฒนาซอฟต์แวร์",
            description: "พัฒนาซอฟต์แวร์ผ่านการทำงานระยะไกล แบบไฮบริด และในสำนักงานในเชียงใหม่ กรุงเทพฯ และต่างประเทศ สร้างแอปพลิเคชันพิสูจน์แนวคิด (PoC) ผลิตภัณฑ์ที่ใช้งานได้ขั้นต่ำ (MVP) ช่วยวิเคราะห์ความต้องการของระบบ และปรับปรุงระบบที่มีอยู่เพื่อตอบสนองต่อความต้องการทางธุรกิจที่เปลี่ยนแปลงไป"
        }
    ],
    stacks: [
        {
            title: "การพัฒนาซอฟต์แวร์และการเชื่อมต่อระบบองค์กร",
            description: "บริการพัฒนาซอฟต์แวร์แบบครบวงจรและการบูรณาการระบบองค์กรที่ออกแบบมาเพื่อสตาร์ทอัพที่เติบโตอย่างรวดเร็วและธุรกิจดิจิทัลเฟิร์ส โดยใช้เฟรมเวิร์กสมัยใหม่ เราสร้างระบบฟรอนต์เอนด์และแบ็กเอนด์ที่สามารถขยายได้ พร้อมทั้งดำเนินการติดตั้ง กำหนดค่า และบูรณาการแพลตฟอร์มสำคัญ เช่น SAP ERP, S/4HANA, ABAP, CRM, MES และอีคอมเมิร์ซ"
        },
        {
            title: "การวิเคราะห์ระบบและการสนับสนุนทางเทคนิค",
            description: "การทำงานวิเคราะห์ระบบเชิงลึก คำแนะนำทางเทคนิคสำหรับการปรับปรุงเพิ่มประสิทธิภาพแอปพลิเคชันและระบบมีความสำคัญต่อธุรกิจ เพื่อสร้างความมั่นใจ ความน่าเชื่อถือ การควบคุมคุณภาพและการทดสอบซอฟต์แวร์ และการใช้งานเทคโนโลยีทันสมัยเพื่อให้ธุรกิจดำเนินการและปรับปรุงอย่างต่อเนื่อง"
        },
        {
            title: "การพัฒนาซอฟต์แวร์คล่องตัว การประสานงานกับทีมงานธุรกิจ",
            description: "การพัฒนาซอฟต์แวร์คล่องตัวและประสานงานกับทีมงานธุรกิจ ทำงานใกล้ชิดกับทีมงานทั้งในและต่างประเทศ ลูกค้าภายในและภายในองค์กร ผู้ใช้งานทางธุรกิจ การทำงานแบบคล่องตัว การทำงานแบบน้ำตก และการทำงานแบบผสม"
        }
    ],
    contact: {
        title: "ติดต่อธุรกิจและความร่วมมือ",
        description: "ยินดีต้อนรับการติดต่อจากผู้ก่อตั้ง CEO, CTO และผู้นำด้านผลิตภัณฑ์",
        roles: [
            {
                title: "Project Manager",
                span: "(ประสานงานโครงการกับลูกค้า)",
                email: "pm@chorn.in.th"
            },
            {
                title: "Chief Technology Officer",
                span: "(สำหรับความร่วมมือด้านเทคโนโลยีหรือการเชื่อมต่อระบบ)",
                email: "cto@chorn.in.th"
            },
            {
                title: "สอบถามทั่วไป",
                span: "(ความร่วมมือเชิงกลยุทธ์)",
                mobilePhone: "เบอร์มือถือ: 064-918 1998",
            },
            {
                title: "สถานที่ใกล้เคียง",
                span: "",
                nearbyShopping: "เซ็นทรัลเฟสติวัลเชียงใหม่ 20 นาที",
                nearbyUniversity1: "มหาวิทยาลัยแม่โจ้ 22 นาที",
                nearbyUniversity2: "มหาวิทยาลัยเชียงใหม่ 29 นาที",
                nearbyAirport: "สนามบินนานาชาติเชียงใหม่ 30 นาที"
            },
        ]
    }
};