import {IAbout} from "@/data/about/model/IAbout";

export const AboutKO: IAbout = {
    title: "소개",
    span: "종합적인 시스템 분석 및 소프트웨어 개발",
    subTitle: "비즈니스 성공을 위한 기술 혁신",
    description: [
        {
            title: "제조 실행 시스템 (MES)",
            description: "2001년에 설립된 CHORN은 대량 전자제품 제조를 위한 소프트웨어 및 하드웨어 엔지니어링, 연구개발(R&D) 엔지니어링 팀과의 하드웨어-소프트웨어 설계 전문성을 보유하고 있으며, 제조 실행 시스템에 특화되어 있습니다. 월 1천만 대 이상의 자동화된 생산 능력을 관리하는 프로젝트를 주도했으며, 부서 간 팀 협업을 통해 시스템 효율성, 신뢰성 및 제품 품질의 지속적인 개선을 이끌었습니다."
        },
        {
            title: "디지털 플랫폼 개발",
            description: "2012년부터 CHORN은 디지털 플랫폼 개발 분야에서 전문성을 확장해 왔으며, 최신 기술, 프레임워크 및 클라우드 시스템을 기반으로 한 확장 가능한 웹 및 모바일 솔루션을 구축하여 사용자의 증가하는 요구를 충족시켜 왔습니다. 아키텍처 설계는 확장 가능하며 수백만 명의 사용자를 지원하고, 기업 시스템 개발을 위한 SAP ERP 및 S/4HANA 관련 프로젝트도 포함되어 있습니다."
        },
        {
            title: "위치 및 근무 형태",
            description: "치앙마이, 방콕 및 국제적으로 원격, 하이브리드 및 오피스 작업을 통해 소프트웨어를 개발합니다. 개념 증명(PoC) 애플리케이션, 최소 실행 가능 제품(MVP)을 만들고, 시스템 요구 사항 분석을 돕고, 기존 시스템을 개선하여 변화하는 비즈니스 요구에 대응합니다."
        }
    ],
    stacks: [
        {
            title: "소프트웨어 개발 및 기업 시스템 통합",
            description: "저희는 빠르게 성장하는 스타트업과 디지털 퍼스트 기업을 위해 엔드투엔드 소프트웨어 개발 및 엔터프라이즈 시스템 통합을 제공합니다. 최신 프레임워크를 활용하여 확장 가능한 프론트엔드 및 백엔드 시스템을 구축하고, SAP ERP, S/4HANA, ABAP, CRM, MES, 전자상거래와 같은 핵심 플랫폼을 구현, 구성 및 통합합니다."
        },
        {
            title: "시스템 분석 및 기술 지원",
            description: "중요 애플리케이션 및 시스템 향상을 위한 심층 시스템 분석 및 기술 권장 사항. 지속적인 비즈니스 운영 및 개선을 위한 신뢰성, 품질 관리, 소프트웨어 테스트 및 최신 기술 구현을 보장합니다."
        },
        {
            title: "애자일 소프트웨어 개발 및 비즈니스 팀 조정",
            description: "비즈니스 팀 조정을 통한 애자일 소프트웨어 개발. 국내 및 국제 팀, 내부 및 외부 고객, 비즈니스 사용자와의 긴밀한 협력. 작업 방법론은 애자일, 워터폴 및 하이브리드 접근 방식을 포함합니다."
        }
    ],
    contact: {
        title: "비즈니스 문의 및 파트너십",
        description: "공동 창업자, CEO, CTO 및 제품 리더의 환영 연락입니다.",
        roles: [
            {
                title: "Project Manager",
                span: "(클라이언트 프로젝트 조율)",
                email: "pm@chorn.in.th"
            },
            {
                title: "Chief Technology Officer",
                span: "(기술 제휴 또는 통합 관련)",
                email: "cto@chorn.in.th"
            },
            {
                title: "인사부",
                span: "(HR 관련 문의, 채용 및 고용에 관한 사항)",
                email: "hr@chorn.in.th"
            },
            {
                title: "일반 문의",
                span: "(전략적 파트너십)",
                officePhone: "사무실 전화: +66 (52) 000 548",
                mobilePhone: "휴대폰: +66 (64) 918 1998",
                locations: {
                    office: "사무실: 태국 치앙마이 50210, 산 사이 지역, 산나멩 서브디스트릭트, Moo 3, 405/112"
                }
            },
            {
                title: "주변 장소",
                span: "",
                nearbyShopping: "센트럴 페스티벌 치앙마이 - 20분",
                nearbyUniversity1: "매조 대학교 - 22분",
                nearbyUniversity2: "치앙마이 대학교 - 29분",
                nearbyAirport: "치앙마이 국제공항 - 30분"
            }
        ]
    }
};